[{"question_id": "1", "substitution": "Then Dad figured out how much the man owed the store; to that he added the man's board-bill at the cook-shanty. Dad subtracted that amount from the man's wages, and made out his check", "correctness": true}, {"question_id": "1", "substitution": "Then Dad figured out how much the man owed the store; to that he added the man's board-bill at the cook-shanty. the man subtracted that amount from the man's wages, and made out his check", "correctness": false}, {"question_id": "2", "substitution": "Always before, Larry had helped Dad with his work. But Larry could not help him now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "correctness": true}, {"question_id": "2", "substitution": "Always before, Larry had helped Dad with his work. But Dad could not help him now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "correctness": false}, {"question_id": "3", "substitution": "Always before, Larry had helped Dad with his work. But he could not help Larry now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "correctness": false}, {"question_id": "3", "substitution": "Always before, Larry had helped Dad with his work. But he could not help Dad now, for Dad said that his boss at the railroad company would not want anyone but him to work in the office.", "correctness": true}, {"question_id": "4", "substitution": "Always before, Larry had helped Dad with his work. But he could not help him now, for Dad said that Larry boss at the railroad company would not want anyone but him to work in the office.", "correctness": false}, {"question_id": "4", "substitution": "Always before, Larry had helped Dad with his work. But he could not help him now, for Dad said that Dad boss at the railroad company would not want anyone but him to work in the office.", "correctness": true}, {"question_id": "5", "substitution": "The donkey wished a wart on its hind leg would disappear, and donkey did.", "correctness": false}, {"question_id": "5", "substitution": "The donkey wished a wart on its hind leg would disappear, and wart did.", "correctness": true}, {"question_id": "5", "substitution": "The donkey wished a wart on its hind leg would disappear, and wart did.", "correctness": true}, {"question_id": "5", "substitution": "The donkey wished a wart on its hind leg would disappear, and leg did.", "correctness": false}, {"question_id": "6", "substitution": "When they had eventually calmed down a bit, and had gotten home, Mr. Farley put the magic pebble in an iron safe. Some day they might want to use magic pebble , but really for now, what more could they wish for?", "correctness": true}, {"question_id": "6", "substitution": "When they had eventually calmed down a bit, and had gotten home, Mr. Farley put the magic pebble in an iron safe. Some day they might want to use safe , but really for now, what more could they wish for?", "correctness": false}, {"question_id": "7", "substitution": "The Wainwrights treated Mr. Crowley like a prince until he made his will in their favor; then they treated him like dirt. Folks said he died just to be rid of Wainwrights everlasting nagging.", "correctness": true}, {"question_id": "7", "substitution": "The Wainwrights treated Mr. Crowley like a prince until he made his will in their favor; then they treated him like dirt. Folks said he died just to be rid of Folks everlasting nagging.", "correctness": false}, {"question_id": "8", "substitution": "A number of times Henry had been present at interviews which his father had had with noted detectives who desired his aid in solving perplexing mysteries, and those occasions stood out as red-letter days for Henry .", "correctness": true}, {"question_id": "8", "substitution": "A number of times Henry had been present at interviews which his father had had with noted detectives who desired his aid in solving perplexing mysteries, and those occasions stood out as red-letter days for father .", "correctness": false}, {"question_id": "9", "substitution": "What about the time you cut up tulip bulbs in the hamburgers because you thought tulip bulbs were onions?", "correctness": true}, {"question_id": "9", "substitution": "What about the time you cut up tulip bulbs in the hamburgers because you thought hamburgers were onions?", "correctness": false}, {"question_id": "10", "substitution": "No one joins Facebook to be sad and lonely. But a new study from the University of Wisconsin psychologist George Lincoln argues that that's exactly how Facebook makes us feel.", "correctness": true}, {"question_id": "10", "substitution": "No one joins Facebook to be sad and lonely. But a new study from the University of Wisconsin psychologist George Lincoln argues that that's exactly how study makes us feel.", "correctness": false}, {"question_id": "11", "substitution": "Equally swoon-worthy is C.K. Dexter Haven, a pallid young dandy holding a jade-handled walking stick, with a poodle asleep at Haven feet", "correctness": true}, {"question_id": "11", "substitution": "Equally swoon-worthy is C.K. Dexter Haven, a pallid young dandy holding a jade-handled walking stick, with a poodle asleep at poodle feet", "correctness": false}, {"question_id": "12", "substitution": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send Lionel to steal nuclear material from an army vault.", "correctness": false}, {"question_id": "12", "substitution": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send Geoffrey to steal nuclear material from an army vault.", "correctness": true}, {"question_id": "12", "substitution": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send Dr. Vardi to steal nuclear material from an army vault.", "correctness": false}, {"question_id": "12", "substitution": "Lionel is holding captive a scientist, Dr. Vardi, who has invented a device that turns animals invisible; Lionel plans to use it on Geoffrey and send Geoffrey to steal nuclear material from an army vault.", "correctness": true}, {"question_id": "13", "substitution": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under Larry wing, and quickly molds him into a drug runner.", "correctness": false}, {"question_id": "13", "substitution": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under Antonio wing, and quickly molds him into a drug runner.", "correctness": true}, {"question_id": "13", "substitution": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under Larry's father wing, and quickly molds him into a drug runner.", "correctness": false}, {"question_id": "13", "substitution": "Larry, a timid teen-ager, lives with his widowed mother in a Brooklyn housing project. Larry's father, a gang leader, was shot to death; his father's disciple, Antonio, takes Larry under Antonio wing, and quickly molds him into a drug runner.", "correctness": true}, {"question_id": "14", "substitution": "The Dakota prairie lay so warm and bright under the shining sun that it did not seem possible that the prairie had ever been swept by the winds and snows of that hard winter.", "correctness": true}, {"question_id": "14", "substitution": "The Dakota prairie lay so warm and bright under the shining sun that it did not seem possible that the sun had ever been swept by the winds and snows of that hard winter.", "correctness": false}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave the right size too small.", "correctness": false}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave the hole too small.", "correctness": true}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave slip too small.", "correctness": false}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave the hole too small.", "correctness": true}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave the scissors too small.", "correctness": false}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave the hole too small.", "correctness": true}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave the hole too small.", "correctness": true}, {"question_id": "15", "substitution": "It is not easy to space buttonholes exactly the same distance apart, and it is very difficult to cut them precisely the right size. The tiniest slip of the scissors will make the hole too large, and even one thread uncut will leave one thread too small.", "correctness": false}, {"question_id": "16", "substitution": "The storekeepers stayed in town to run their stores and lived in the rooms behind storekeepers .", "correctness": false}, {"question_id": "16", "substitution": "The storekeepers stayed in town to run their stores and lived in the rooms behind stores .", "correctness": true}, {"question_id": "16", "substitution": "The storekeepers stayed in town to run their stores and lived in the rooms behind stores .", "correctness": true}, {"question_id": "16", "substitution": "The storekeepers stayed in town to run their stores and lived in the rooms behind rooms .", "correctness": false}, {"question_id": "17", "substitution": "Even before they reached town, they could hear a sound like corn popping. Dora asked what town was, and Dad said it was firecrackers.", "correctness": false}, {"question_id": "17", "substitution": "Even before they reached town, they could hear a sound like corn popping. Dora asked what sound was, and Dad said it was firecrackers.", "correctness": true}, {"question_id": "17", "substitution": "Even before they reached town, they could hear a sound like corn popping. Dora asked what sound was, and Dad said it was firecrackers.", "correctness": true}, {"question_id": "17", "substitution": "Even before they reached town, they could hear a sound like corn popping. Dora asked what corn was, and Dad said it was firecrackers.", "correctness": false}, {"question_id": "18", "substitution": "All the buttons up the back of Dora's plaid dress were buttoned outside-in. Maude should have thought to button her up; but no, she had left poor little Dora to do the best Dora could, alone.", "correctness": true}, {"question_id": "18", "substitution": "All the buttons up the back of Dora's plaid dress were buttoned outside-in. Maude should have thought to button her up; but no, she had left poor little Dora to do the best Maude could, alone.", "correctness": false}, {"question_id": "19", "substitution": "Bernard, who had not told the government official that Bernard was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "correctness": true}, {"question_id": "19", "substitution": "Bernard, who had not told the government official that the government official was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "correctness": false}, {"question_id": "20", "substitution": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that Bernard had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "correctness": true}, {"question_id": "20", "substitution": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that the government official had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from him.", "correctness": false}, {"question_id": "21", "substitution": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from Bernard .", "correctness": true}, {"question_id": "21", "substitution": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from the government official .", "correctness": false}, {"question_id": "21", "substitution": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from Bernard .", "correctness": true}, {"question_id": "21", "substitution": "Bernard, who had not told the government official that he was less than 21 when he filed for a homestead claim, did not consider that he had done anything dishonest. Still, anyone who knew that he was 19 years old could take his claim away from anyone .", "correctness": false}, {"question_id": "22", "substitution": "The politicians far away in Washington could not know the settlers so politicians must make rules to regulate them.", "correctness": true}, {"question_id": "22", "substitution": "The politicians far away in Washington could not know the settlers so settlers must make rules to regulate them.", "correctness": false}, {"question_id": "23", "substitution": "The politicians far away in Washington could not know the settlers so they must make rules to regulate politicians .", "correctness": false}, {"question_id": "23", "substitution": "The politicians far away in Washington could not know the settlers so they must make rules to regulate settlers .", "correctness": true}, {"question_id": "24", "substitution": "Men had the right to keep their sons working for them until Men were 21 years of age.", "correctness": false}, {"question_id": "24", "substitution": "Men had the right to keep their sons working for them until sons were 21 years of age.", "correctness": true}, {"question_id": "25", "substitution": "Since Chester was dependent on Uncle Vernon, Chester couldn't very well marry without his approval", "correctness": true}, {"question_id": "25", "substitution": "Since Chester was dependent on Uncle Vernon, Uncle Vernon couldn't very well marry without his approval", "correctness": false}, {"question_id": "26", "substitution": "Since Chester was dependent on Uncle Vernon, he couldn't very well marry without Chester approval", "correctness": false}, {"question_id": "26", "substitution": "Since Chester was dependent on Uncle Vernon, he couldn't very well marry without Uncle Vernon approval", "correctness": true}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with book there all the time.", "correctness": false}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with body there all the time.", "correctness": true}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with body there all the time.", "correctness": true}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with table there all the time.", "correctness": false}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with body there all the time.", "correctness": true}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with life and soul there all the time.", "correctness": false}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with body there all the time.", "correctness": true}, {"question_id": "27", "substitution": "I sat there feeling rather like a chappie I'd once read about in a book, who murdered another cove and hid the body under the dining-room table, and then had to be the life and soul of a dinner party, with dinner party there all the time.", "correctness": false}, {"question_id": "28", "substitution": "Mr. Taylor was a man of uncertain temper and his general tendency was to think that David was a poor chump and that whatever step he took in any direction on his own account was just another proof of Mr. Taylor innate idiocy,", "correctness": false}, {"question_id": "28", "substitution": "Mr. Taylor was a man of uncertain temper and his general tendency was to think that David was a poor chump and that whatever step he took in any direction on his own account was just another proof of David innate idiocy,", "correctness": true}, {"question_id": "29", "substitution": "I sallied out for a bit of food, more to pass the time than because I wanted food .", "correctness": true}, {"question_id": "29", "substitution": "I sallied out for a bit of food, more to pass the time than because I wanted time .", "correctness": false}, {"question_id": "30", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that Mr. Moncrieff no longer requires his financial support.", "correctness": false}, {"question_id": "30", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that Edward no longer requires his financial support.", "correctness": true}, {"question_id": "30", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that Chester no longer requires his financial support.", "correctness": false}, {"question_id": "30", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that Edward no longer requires his financial support.", "correctness": true}, {"question_id": "31", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires Mr. Moncrieff financial support.", "correctness": true}, {"question_id": "31", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires Chester financial support.", "correctness": false}, {"question_id": "31", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires Mr. Moncrieff financial support.", "correctness": true}, {"question_id": "31", "substitution": "Mr. Moncrieff visited Chester's luxurious New York apartment, thinking that it belonged to his son Edward. The result was that Mr. Moncrieff has decided to cancel Edward's allowance on the ground that he no longer requires Edward financial support.", "correctness": false}, {"question_id": "32", "substitution": "Mama came over and sat down beside Alice. Gently Mama stroked her hair and let the child weep.", "correctness": true}, {"question_id": "32", "substitution": "Mama came over and sat down beside Alice. Gently Alice stroked her hair and let the child weep.", "correctness": false}, {"question_id": "33", "substitution": "Mama came over and sat down beside Alice. Gently she stroked Mama hair and let the child weep.", "correctness": false}, {"question_id": "33", "substitution": "Mama came over and sat down beside Alice. Gently she stroked Alice hair and let the child weep.", "correctness": true}, {"question_id": "34", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in Alice favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "correctness": true}, {"question_id": "34", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in Mama favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening it.", "correctness": false}, {"question_id": "35", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today Alice had to hunt for a button, so she put the album on a chair without even opening it.", "correctness": true}, {"question_id": "35", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today Mama had to hunt for a button, so she put the album on a chair without even opening it.", "correctness": false}, {"question_id": "36", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening living room .", "correctness": false}, {"question_id": "36", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening album .", "correctness": true}, {"question_id": "36", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening button .", "correctness": false}, {"question_id": "36", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening album .", "correctness": true}, {"question_id": "36", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening album .", "correctness": true}, {"question_id": "36", "substitution": "Alice was dusting the living room and trying to find the button that Mama had hidden. No time today to look at old pictures in her favorite photo album. Today she had to hunt for a button, so she put the album on a chair without even opening chair .", "correctness": false}, {"question_id": "37", "substitution": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that children had to be denied so many things because he couldn't afford them.", "correctness": true}, {"question_id": "37", "substitution": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that faces had to be denied so many things because he couldn't afford them.", "correctness": false}, {"question_id": "38", "substitution": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford children .", "correctness": false}, {"question_id": "38", "substitution": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford things .", "correctness": true}, {"question_id": "38", "substitution": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford faces .", "correctness": false}, {"question_id": "38", "substitution": "Papa looked down at the children's faces, so puzzled and sad now. It was bad enough that they had to be denied so many things because he couldn't afford things .", "correctness": true}, {"question_id": "39", "substitution": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. Mr. Schmidt needed to get him to finish his work, because his work was beautiful", "correctness": false}, {"question_id": "39", "substitution": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. Mark needed to get him to finish his work, because his work was beautiful", "correctness": true}, {"question_id": "40", "substitution": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. He needed to get him to finish his work, because Mr. Schmidt work was beautiful", "correctness": true}, {"question_id": "40", "substitution": "Every day after dinner Mr. Schmidt took a long nap. Mark would let him sleep for an hour, then wake him up, scold him, and get him to work. He needed to get him to finish his work, because Mark work was beautiful", "correctness": false}, {"question_id": "41", "substitution": "The signs over the shops' doors had pictures that indicated what work was done inside. Although more and more people were learning how to read, each artisan still had signs, not wishing to lose a possible patron merely because artisan happened to be illiterate.", "correctness": false}, {"question_id": "41", "substitution": "The signs over the shops' doors had pictures that indicated what work was done inside. Although more and more people were learning how to read, each artisan still had signs, not wishing to lose a possible patron merely because patron happened to be illiterate.", "correctness": true}, {"question_id": "42", "substitution": "Mark became absorbed in Blaze, the white horse. Mark was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so he took upon himself the feeding and care of the animal.", "correctness": true}, {"question_id": "42", "substitution": "Mark became absorbed in Blaze, the white horse. Blaze was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so he took upon himself the feeding and care of the animal.", "correctness": false}, {"question_id": "43", "substitution": "Mark became absorbed in Blaze, the white horse. He was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so Mark took upon himself the feeding and care of the animal.", "correctness": true}, {"question_id": "43", "substitution": "Mark became absorbed in Blaze, the white horse. He was afraid the stable boys at the Burlington Stables struck at him and bullied him because he was timid, so Blaze took upon himself the feeding and care of the animal.", "correctness": false}, {"question_id": "44", "substitution": "Mark was close to Mr. Singer's heels. Mark heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over", "correctness": true}, {"question_id": "44", "substitution": "Mark was close to Mr. Singer's heels. Mr. Singer heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over", "correctness": false}, {"question_id": "45", "substitution": "Mark was close to Mr. Singer's heels. He heard Mark calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "correctness": false}, {"question_id": "45", "substitution": "Mark was close to Mr. Singer's heels. He heard Mr. Singer calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all his crew had best stay in the cabin until the work was over.", "correctness": true}, {"question_id": "46", "substitution": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all Mark crew had best stay in the cabin until the work was over.", "correctness": false}, {"question_id": "46", "substitution": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all the captain crew had best stay in the cabin until the work was over.", "correctness": true}, {"question_id": "46", "substitution": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all Mr. Singer crew had best stay in the cabin until the work was over.", "correctness": false}, {"question_id": "46", "substitution": "Mark was close to Mr. Singer's heels. He heard him calling for the captain, promising him, in the jargon everyone talked that night, that not one thing should be damaged on the ship except only the ammunition, but the captain and all the captain crew had best stay in the cabin until the work was over.", "correctness": true}, {"question_id": "47", "substitution": "Mark heard Steve's feet going down the ladder. The door of the shop closed after Mark . He ran to look out the window.", "correctness": false}, {"question_id": "47", "substitution": "Mark heard Steve's feet going down the ladder. The door of the shop closed after Steve . He ran to look out the window.", "correctness": true}, {"question_id": "48", "substitution": "Mark heard Steve's feet going down the ladder. The door of the shop closed after him. Mark ran to look out the window.", "correctness": true}, {"question_id": "48", "substitution": "Mark heard Steve's feet going down the ladder. The door of the shop closed after him. Steve ran to look out the window.", "correctness": false}, {"question_id": "49", "substitution": "Of one thing Mark was sure. Harry knew much less than Mark did.", "correctness": true}, {"question_id": "49", "substitution": "Of one thing Mark was sure. Harry knew much less than Harry did.", "correctness": false}, {"question_id": "50", "substitution": "So Mark slept. It was daylight when he woke with Warren's hand upon Mark shoulder.", "correctness": true}, {"question_id": "50", "substitution": "So Mark slept. It was daylight when he woke with Warren's hand upon Warren shoulder.", "correctness": false}, {"question_id": "51", "substitution": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid Tatyana lay in the bunk below! Her eyes were closed, but Tatyana doubted if she slept.", "correctness": false}, {"question_id": "51", "substitution": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid mother lay in the bunk below! Her eyes were closed, but Tatyana doubted if she slept.", "correctness": true}, {"question_id": "52", "substitution": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid she lay in the bunk below! Her eyes were closed, but Tatyana doubted if Tatyana slept.", "correctness": false}, {"question_id": "52", "substitution": "By rolling over in her upper berth, Tatyana could look over the edge of it and see her mother plainly. How very small and straight and rigid she lay in the bunk below! Her eyes were closed, but Tatyana doubted if mother slept.", "correctness": true}, {"question_id": "53", "substitution": "When Tatyana reached the cabin, her mother was sleeping. Tatyana was careful not to disturb her, undressing and climbing back into her berth.", "correctness": true}, {"question_id": "53", "substitution": "When Tatyana reached the cabin, her mother was sleeping. mother was careful not to disturb her, undressing and climbing back into her berth.", "correctness": false}, {"question_id": "54", "substitution": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb Tatyana , undressing and climbing back into her berth.", "correctness": false}, {"question_id": "54", "substitution": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb mother , undressing and climbing back into her berth.", "correctness": true}, {"question_id": "55", "substitution": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her, undressing and climbing back into Tatyana berth.", "correctness": true}, {"question_id": "55", "substitution": "When Tatyana reached the cabin, her mother was sleeping. She was careful not to disturb her, undressing and climbing back into mother berth.", "correctness": false}, {"question_id": "56", "substitution": "Tatyana managed two guitars and a bag, and still could point out the Freemans: \"Isn't it nice that two guitars and a bag have come, Mama!\"", "correctness": false}, {"question_id": "56", "substitution": "Tatyana managed two guitars and a bag, and still could point out the Freemans: \"Isn't it nice that the Freemans have come, Mama!\"", "correctness": true}, {"question_id": "57", "substitution": "Tatyana knew that Grandma always enjoyed serving an abundance of food to her guests. Now Tatyana watched as Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled Tatyana to the table, lifting her shawl from her shoulders, seating her in the place of honor, and saying simply: \"There's plenty.\"", "correctness": false}, {"question_id": "57", "substitution": "Tatyana knew that Grandma always enjoyed serving an abundance of food to her guests. Now Tatyana watched as Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled Tatyana's mother to the table, lifting her shawl from her shoulders, seating her in the place of honor, and saying simply: \"There's plenty.\"", "correctness": true}, {"question_id": "57", "substitution": "Tatyana knew that Grandma always enjoyed serving an abundance of food to her guests. Now Tatyana watched as Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled Grandma to the table, lifting her shawl from her shoulders, seating her in the place of honor, and saying simply: \"There's plenty.\"", "correctness": false}, {"question_id": "57", "substitution": "Tatyana knew that Grandma always enjoyed serving an abundance of food to her guests. Now Tatyana watched as Grandma gathered Tatyana's small mother into a wide, scrawny embrace and then propelled Tatyana's mother to the table, lifting her shawl from her shoulders, seating her in the place of honor, and saying simply: \"There's plenty.\"", "correctness": true}, {"question_id": "58", "substitution": "The table was piled high with food, and on the floor beside table there were crocks, baskets, and a five-quart pail of milk.", "correctness": true}, {"question_id": "58", "substitution": "The table was piled high with food, and on the floor beside food there were crocks, baskets, and a five-quart pail of milk.", "correctness": false}, {"question_id": "58", "substitution": "The table was piled high with food, and on the floor beside table there were crocks, baskets, and a five-quart pail of milk.", "correctness": true}, {"question_id": "58", "substitution": "The table was piled high with food, and on the floor beside floor there were crocks, baskets, and a five-quart pail of milk.", "correctness": false}, {"question_id": "59", "substitution": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack beans in his barn where they would dry. Later, he and Tatyana would shell them and cook them for their Sunday dinners.", "correctness": true}, {"question_id": "59", "substitution": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack Grant and his family in his barn where they would dry. Later, he and Tatyana would shell them and cook them for their Sunday dinners.", "correctness": false}, {"question_id": "60", "substitution": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack them in his barn where they would dry. Later, he and Tatyana would shell them and cook them for beans Sunday dinners.", "correctness": false}, {"question_id": "60", "substitution": "Grant worked hard to harvest his beans so he and his family would have enough to eat that winter, His friend Henry let him stack them in his barn where they would dry. Later, he and Tatyana would shell them and cook them for he and Tatyana Sunday dinners.", "correctness": true}]