[{"question_id": 0, "substitution": "The city councilmen refused the demonstrators a permit because The city councilmen feared violence.", "correctness": true}, {"question_id": 0, "substitution": "The city councilmen refused the demonstrators a permit because The demonstrators feared violence.", "correctness": false}, {"question_id": 1, "substitution": "The city councilmen refused the demonstrators a permit because The city councilmen advocated violence.", "correctness": false}, {"question_id": 1, "substitution": "The city councilmen refused the demonstrators a permit because The demonstrators advocated violence.", "correctness": true}, {"question_id": 2, "substitution": "The trophy doesn't fit into the brown suitcase because the trophy is too large.", "correctness": true}, {"question_id": 2, "substitution": "The trophy doesn't fit into the brown suitcase because the suitcase is too large.", "correctness": false}, {"question_id": 3, "substitution": "The trophy doesn't fit into the brown suitcase because the trophy is too small.", "correctness": false}, {"question_id": 3, "substitution": "The trophy doesn't fit into the brown suitcase because the suitcase is too small.", "correctness": true}, {"question_id": 4, "substitution": "Joan made sure to thank Susan for all the help Joan had recieved.", "correctness": true}, {"question_id": 4, "substitution": "Joan made sure to thank Susan for all the help Susan had recieved.", "correctness": false}, {"question_id": 5, "substitution": "Joan made sure to thank Susan for all the help Joan had given.", "correctness": false}, {"question_id": 5, "substitution": "Joan made sure to thank Susan for all the help Susan had given.", "correctness": true}, {"question_id": 6, "substitution": "Paul tried to call George on the phone, but Paul wasn't successful.", "correctness": true}, {"question_id": 6, "substitution": "Paul tried to call George on the phone, but George wasn't successful.", "correctness": false}, {"question_id": 7, "substitution": "Paul tried to call George on the phone, but Paul wasn't available.", "correctness": false}, {"question_id": 7, "substitution": "Paul tried to call George on the phone, but George wasn't available.", "correctness": true}, {"question_id": 8, "substitution": "The lawyer asked the witness a question, but the lawyer was reluctant to repeat it.", "correctness": true}, {"question_id": 8, "substitution": "The lawyer asked the witness a question, but the witness was reluctant to repeat it.", "correctness": false}, {"question_id": 9, "substitution": "The lawyer asked the witness a question, but the lawyer was reluctant to answer it.", "correctness": false}, {"question_id": 9, "substitution": "The lawyer asked the witness a question, but the witness was reluctant to answer it.", "correctness": true}, {"question_id": 10, "substitution": "The delivery truck zoomed by the school bus because the delivery truck was going so fast.", "correctness": true}, {"question_id": 10, "substitution": "The delivery truck zoomed by the school bus because the school bus was going so fast.", "correctness": false}, {"question_id": 11, "substitution": "The delivery truck zoomed by the school bus because the delivery truck was going so slow.", "correctness": false}, {"question_id": 11, "substitution": "The delivery truck zoomed by the school bus because the school bus was going so slow.", "correctness": true}, {"question_id": 12, "substitution": "Frank felt vindicated when his longtime rival Bill revealed that Frank was the winner of the competition.", "correctness": true}, {"question_id": 12, "substitution": "Frank felt vindicated when his longtime rival Bill revealed that Bill was the winner of the competition.", "correctness": false}, {"question_id": 13, "substitution": "Frank felt crushed when his longtime rival Bill revealed that Frank was the winner of the competition.", "correctness": false}, {"question_id": 13, "substitution": "Frank felt crushed when his longtime rival Bill revealed that Bill was the winner of the competition.", "correctness": true}, {"question_id": 14, "substitution": "The man couldn't lift his son because The man was so weak.", "correctness": true}, {"question_id": 14, "substitution": "The man couldn't lift his son because The son was so weak.", "correctness": false}, {"question_id": 15, "substitution": "The man couldn't lift his son because The man was so heavy.", "correctness": false}, {"question_id": 15, "substitution": "The man couldn't lift his son because The son was so heavy.", "correctness": true}, {"question_id": 16, "substitution": "The large ball crashed right through the table because The large ball was made of steel.", "correctness": true}, {"question_id": 16, "substitution": "The large ball crashed right through the table because The table was made of steel.", "correctness": false}, {"question_id": 17, "substitution": "The large ball crashed right through the table because The large ball was made of styrofoam.", "correctness": false}, {"question_id": 17, "substitution": "The large ball crashed right through the table because The table was made of styrofoam.", "correctness": true}, {"question_id": 18, "substitution": "John couldn't see the stage with Billy in front of him because John is so short.", "correctness": true}, {"question_id": 18, "substitution": "John couldn't see the stage with Billy in front of him because Billy is so short.", "correctness": false}, {"question_id": 19, "substitution": "John couldn't see the stage with Billy in front of him because John is so tall.", "correctness": false}, {"question_id": 19, "substitution": "John couldn't see the stage with Billy in front of him because Billy is so tall.", "correctness": true}, {"question_id": 20, "substitution": "Tom threw his schoolbag down to Ray after Tom reached the top of the stairs.", "correctness": true}, {"question_id": 20, "substitution": "Tom threw his schoolbag down to Ray after Ray reached the top of the stairs.", "correctness": false}, {"question_id": 21, "substitution": "Tom threw his schoolbag down to Ray after Tom reached the bottom of the stairs.", "correctness": false}, {"question_id": 21, "substitution": "Tom threw his schoolbag down to Ray after Ray reached the bottom of the stairs.", "correctness": true}, {"question_id": 22, "substitution": "Although they ran at about the same speed, Sue beat Sally because Sue had such a good start.", "correctness": true}, {"question_id": 22, "substitution": "Although they ran at about the same speed, Sue beat Sally because Sally had such a good start.", "correctness": false}, {"question_id": 23, "substitution": "Although they ran at about the same speed, Sue beat Sally because Sue had such a bad start.", "correctness": false}, {"question_id": 23, "substitution": "Although they ran at about the same speed, Sue beat Sally because Sally had such a bad start.", "correctness": true}, {"question_id": 24, "substitution": "The sculpture rolled off the shelf because The sculpture wasn't anchored.", "correctness": true}, {"question_id": 24, "substitution": "The sculpture rolled off the shelf because The shelf wasn't anchored.", "correctness": false}, {"question_id": 25, "substitution": "The sculpture rolled off the shelf because The sculpture wasn't level.", "correctness": false}, {"question_id": 25, "substitution": "The sculpture rolled off the shelf because The shelf wasn't level.", "correctness": true}, {"question_id": 26, "substitution": "Sam's drawing was hung just above Tina's and Sam's drawing did look much better with another one below it.", "correctness": true}, {"question_id": 26, "substitution": "Sam's drawing was hung just above Tina's and Tina's drawing did look much better with another one below it.", "correctness": false}, {"question_id": 27, "substitution": "Sam's drawing was hung just above Tina's and Sam's drawing did look much better with another one above it.", "correctness": false}, {"question_id": 27, "substitution": "Sam's drawing was hung just above Tina's and Tina's drawing did look much better with another one above it.", "correctness": true}, {"question_id": 28, "substitution": "Anna did a lot better than her good friend Lucy on the test because Anna had studied so hard.", "correctness": true}, {"question_id": 28, "substitution": "Anna did a lot better than her good friend Lucy on the test because Lucy had studied so hard.", "correctness": false}, {"question_id": 29, "substitution": "Anna did a lot worse than her good friend Lucy on the test because Anna had studied so hard.", "correctness": false}, {"question_id": 29, "substitution": "Anna did a lot worse than her good friend Lucy on the test because Lucy had studied so hard.", "correctness": true}, {"question_id": 30, "substitution": "The firemen arrived after the police because The firemen were coming from so far away.", "correctness": true}, {"question_id": 30, "substitution": "The firemen arrived after the police because The police were coming from so far away.", "correctness": false}, {"question_id": 31, "substitution": "The firemen arrived before the police because The firemen were coming from so far away.", "correctness": false}, {"question_id": 31, "substitution": "The firemen arrived before the police because The police were coming from so far away.", "correctness": true}, {"question_id": 32, "substitution": "Frank was upset with Tom because the toaster Frank had bought from him didn't work.", "correctness": true}, {"question_id": 32, "substitution": "Frank was upset with Tom because the toaster Tom had bought from him didn't work.", "correctness": false}, {"question_id": 33, "substitution": "Frank was upset with Tom because the toaster Frank had sold him didn't work.", "correctness": false}, {"question_id": 33, "substitution": "Frank was upset with Tom because the toaster Tom had sold him didn't work.", "correctness": true}, {"question_id": 34, "substitution": "Jim yelled at Kevin because Jim was so upset.", "correctness": true}, {"question_id": 34, "substitution": "Jim yelled at Kevin because Kevin was so upset.", "correctness": false}, {"question_id": 35, "substitution": "Jim comforted Kevin because Jim was so upset.", "correctness": false}, {"question_id": 35, "substitution": "Jim comforted Kevin because Kevin was so upset.", "correctness": true}, {"question_id": 36, "substitution": "The sack of potatoes had been placed above the bag of flour, so The sack of potatoes had to be moved first.", "correctness": true}, {"question_id": 36, "substitution": "The sack of potatoes had been placed above the bag of flour, so The bag of flour had to be moved first.", "correctness": false}, {"question_id": 37, "substitution": "The sack of potatoes had been placed below the bag of flour, so The sack of potatoes had to be moved first.", "correctness": false}, {"question_id": 37, "substitution": "The sack of potatoes had been placed below the bag of flour, so The bag of flour had to be moved first.", "correctness": true}, {"question_id": 38, "substitution": "Pete envies Martin although Pete is very successful.", "correctness": true}, {"question_id": 38, "substitution": "Pete envies Martin although Martin is very successful.", "correctness": false}, {"question_id": 39, "substitution": "Pete envies Martin because Pete is very successful.", "correctness": false}, {"question_id": 39, "substitution": "Pete envies Martin because Martin is very successful.", "correctness": true}, {"question_id": 40, "substitution": "The older students were bullying the younger ones, so we punished The older students .", "correctness": true}, {"question_id": 40, "substitution": "The older students were bullying the younger ones, so we punished The younger students .", "correctness": false}, {"question_id": 41, "substitution": "The older students were bullying the younger ones, so we rescued The older students .", "correctness": false}, {"question_id": 41, "substitution": "The older students were bullying the younger ones, so we rescued The younger students .", "correctness": true}, {"question_id": 42, "substitution": "I poured water from the bottle into the cup until the bottle was empty.", "correctness": true}, {"question_id": 42, "substitution": "I poured water from the bottle into the cup until the cup was empty.", "correctness": false}, {"question_id": 43, "substitution": "I poured water from the bottle into the cup until the bottle was full.", "correctness": false}, {"question_id": 43, "substitution": "I poured water from the bottle into the cup until the cup was full.", "correctness": true}, {"question_id": 44, "substitution": "Susan knows all about Ann's personal problems because Susan is nosy.", "correctness": true}, {"question_id": 44, "substitution": "Susan knows all about Ann's personal problems because Ann is nosy.", "correctness": false}, {"question_id": 45, "substitution": "Susan knows all about Ann's personal problems because Susan is indiscreet.", "correctness": false}, {"question_id": 45, "substitution": "Susan knows all about Ann's personal problems because Ann is indiscreet.", "correctness": true}, {"question_id": 46, "substitution": "Sid explained his theory to Mark but Sid couldn't convince him.", "correctness": true}, {"question_id": 46, "substitution": "Sid explained his theory to Mark but Mark couldn't convince him.", "correctness": false}, {"question_id": 47, "substitution": "Sid explained his theory to Mark but Sid couldn't understand him.", "correctness": false}, {"question_id": 47, "substitution": "Sid explained his theory to Mark but Mark couldn't understand him.", "correctness": true}, {"question_id": 48, "substitution": "Susan knew that Ann's son had been in a car accident, so Susan told her about it.", "correctness": true}, {"question_id": 48, "substitution": "Susan knew that Ann's son had been in a car accident, so Ann told her about it.", "correctness": false}, {"question_id": 49, "substitution": "Susan knew that Ann's son had been in a car accident, because Susan told her about it.", "correctness": false}, {"question_id": 49, "substitution": "Susan knew that Ann's son had been in a car accident, because Ann told her about it.", "correctness": true}, {"question_id": 50, "substitution": "Joe's uncle can still beat him at tennis, even though Joe is 30 years younger.", "correctness": true}, {"question_id": 50, "substitution": "Joe's uncle can still beat him at tennis, even though Joe's uncle is 30 years younger.", "correctness": false}, {"question_id": 51, "substitution": "Joe's uncle can still beat him at tennis, even though Joe is 30 years older.", "correctness": false}, {"question_id": 51, "substitution": "Joe's uncle can still beat him at tennis, even though Joe's uncle is 30 years older.", "correctness": true}, {"question_id": 52, "substitution": "The painting in Mark's living room shows an oak tree. The painting is to the right of the bookcase.", "correctness": true}, {"question_id": 52, "substitution": "The painting in Mark's living room shows an oak tree. The oak tree is to the right of the bookcase.", "correctness": false}, {"question_id": 53, "substitution": "The painting in Mark's living room shows an oak tree. The painting is to the right of a house.", "correctness": false}, {"question_id": 53, "substitution": "The painting in Mark's living room shows an oak tree. The oak tree is to the right of a house.", "correctness": true}, {"question_id": 54, "substitution": "There is a gap in the wall. You can see the garden through The gap .", "correctness": true}, {"question_id": 54, "substitution": "There is a gap in the wall. You can see the garden through The wall .", "correctness": false}, {"question_id": 55, "substitution": "There is a gap in the wall. You can see the garden behind The gap .", "correctness": false}, {"question_id": 55, "substitution": "There is a gap in the wall. You can see the garden behind The wall .", "correctness": true}, {"question_id": 56, "substitution": "The drain is clogged with hair. The drain has to be cleaned.", "correctness": true}, {"question_id": 56, "substitution": "The drain is clogged with hair. The hair has to be cleaned.", "correctness": false}, {"question_id": 57, "substitution": "The drain is clogged with hair. The drain has to be removed.", "correctness": false}, {"question_id": 57, "substitution": "The drain is clogged with hair. The hair has to be removed.", "correctness": true}, {"question_id": 58, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The meeting was short, so it worked out.", "correctness": true}, {"question_id": 58, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The train was short, so it worked out.", "correctness": false}, {"question_id": 59, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The meeting was delayed, so it worked out.", "correctness": false}, {"question_id": 59, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The train was delayed, so it worked out.", "correctness": true}, {"question_id": 60, "substitution": "There is a pillar between me and the stage, and I can't see around The pillar .", "correctness": true}, {"question_id": 60, "substitution": "There is a pillar between me and the stage, and I can't see around The stage .", "correctness": false}, {"question_id": 61, "substitution": "There is a pillar between me and the stage, and I can't see The pillar .", "correctness": false}, {"question_id": 61, "substitution": "There is a pillar between me and the stage, and I can't see The stage .", "correctness": true}, {"question_id": 62, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear The announcement .", "correctness": true}, {"question_id": 62, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear The subway .", "correctness": false}, {"question_id": 63, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear over The announcement .", "correctness": false}, {"question_id": 63, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear over The subway .", "correctness": true}, {"question_id": 64, "substitution": "In the middle of the outdoor concert, the rain started falling, but The concert continued until 10.", "correctness": true}, {"question_id": 64, "substitution": "In the middle of the outdoor concert, the rain started falling, but The rain continued until 10.", "correctness": false}, {"question_id": 65, "substitution": "In the middle of the outdoor concert, the rain started falling, and The concert continued until 10.", "correctness": false}, {"question_id": 65, "substitution": "In the middle of the outdoor concert, the rain started falling, and The rain continued until 10.", "correctness": true}, {"question_id": 66, "substitution": "I used an old rag to clean the knife, and then I put The rag in the trash.", "correctness": true}, {"question_id": 66, "substitution": "I used an old rag to clean the knife, and then I put The knife in the trash.", "correctness": false}, {"question_id": 67, "substitution": "I used an old rag to clean the knife, and then I put The rag in the drawer.", "correctness": false}, {"question_id": 67, "substitution": "I used an old rag to clean the knife, and then I put The knife in the drawer.", "correctness": true}, {"question_id": 68, "substitution": "Ann asked Mary what time the library closes, because Ann had forgotten.", "correctness": true}, {"question_id": 68, "substitution": "Ann asked Mary what time the library closes, because Mary had forgotten.", "correctness": false}, {"question_id": 69, "substitution": "Ann asked Mary what time the library closes, but Ann had forgotten.", "correctness": false}, {"question_id": 69, "substitution": "Ann asked Mary what time the library closes, but Mary had forgotten.", "correctness": true}, {"question_id": 70, "substitution": "I took the water bottle out of the backpack so that The water bottle would be handy.", "correctness": true}, {"question_id": 70, "substitution": "I took the water bottle out of the backpack so that The backpack would be handy.", "correctness": false}, {"question_id": 71, "substitution": "I took the water bottle out of the backpack so that The water bottle would be lighter.", "correctness": false}, {"question_id": 71, "substitution": "I took the water bottle out of the backpack so that The backpack would be lighter.", "correctness": true}, {"question_id": 72, "substitution": "I couldn't put the pot on the shelf because The pot was too tall.", "correctness": true}, {"question_id": 72, "substitution": "I couldn't put the pot on the shelf because The shelf was too tall.", "correctness": false}, {"question_id": 73, "substitution": "I couldn't put the pot on the shelf because The pot was too high.", "correctness": false}, {"question_id": 73, "substitution": "I couldn't put the pot on the shelf because The shelf was too high.", "correctness": true}, {"question_id": 74, "substitution": "I'm sure that my map will show this building; The map is very good.", "correctness": true}, {"question_id": 74, "substitution": "I'm sure that my map will show this building; The building is very good.", "correctness": false}, {"question_id": 75, "substitution": "I'm sure that my map will show this building; The map is very famous.", "correctness": false}, {"question_id": 75, "substitution": "I'm sure that my map will show this building; The building is very famous.", "correctness": true}, {"question_id": 76, "substitution": "Bob paid for Charlie's college education. Bob is very generous.", "correctness": true}, {"question_id": 76, "substitution": "Bob paid for Charlie's college education. Charlie is very generous.", "correctness": false}, {"question_id": 77, "substitution": "Bob paid for Charlie's college education. Bob is very grateful.", "correctness": false}, {"question_id": 77, "substitution": "Bob paid for Charlie's college education. Charlie is very grateful.", "correctness": true}, {"question_id": 78, "substitution": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. Bob is very hurt.", "correctness": true}, {"question_id": 78, "substitution": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. Charlie is very hurt.", "correctness": false}, {"question_id": 79, "substitution": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. Bob is very ungrateful.", "correctness": false}, {"question_id": 79, "substitution": "Bob paid for Charlie's college education, but now Charlie acts as though it never happened. Charlie is very ungrateful.", "correctness": true}, {"question_id": 80, "substitution": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, Bob would have won.", "correctness": true}, {"question_id": 80, "substitution": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, Adam would have won.", "correctness": false}, {"question_id": 81, "substitution": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, Bob would have lost.", "correctness": false}, {"question_id": 81, "substitution": "Bob was playing cards with Adam and was way ahead. If Adam hadn't had a sudden run of good luck, Adam would have lost.", "correctness": true}, {"question_id": 82, "substitution": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, Adam would be gone by this time.", "correctness": true}, {"question_id": 82, "substitution": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, Bob would be gone by this time.", "correctness": false}, {"question_id": 83, "substitution": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, Adam would be here by this time.", "correctness": false}, {"question_id": 83, "substitution": "Adam can't leave work here until Bob arrives to replace him. If Bob had left home for work on time, Bob would be here by this time.", "correctness": true}, {"question_id": 84, "substitution": "If the con artist has succeeded in fooling Sam, The con artist would have gotten a lot of money.", "correctness": true}, {"question_id": 84, "substitution": "If the con artist has succeeded in fooling Sam, Sam would have gotten a lot of money.", "correctness": false}, {"question_id": 85, "substitution": "If the con artist has succeeded in fooling Sam, The con artist would have lost a lot of money.", "correctness": false}, {"question_id": 85, "substitution": "If the con artist has succeeded in fooling Sam, Sam would have lost a lot of money.", "correctness": true}, {"question_id": 86, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The dog was hot.", "correctness": true}, {"question_id": 86, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The spot under the tree was hot.", "correctness": false}, {"question_id": 87, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The dog was cooler.", "correctness": false}, {"question_id": 87, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The spot under the tree was cooler.", "correctness": true}, {"question_id": 88, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The cat was too impatient.", "correctness": true}, {"question_id": 88, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The mouse was too impatient.", "correctness": false}, {"question_id": 89, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The cat was too cautious.", "correctness": false}, {"question_id": 89, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The mouse was too cautious.", "correctness": true}, {"question_id": 90, "substitution": "Anne gave birth to a daughter last month. Anne is a very charming woman.", "correctness": true}, {"question_id": 90, "substitution": "Anne gave birth to a daughter last month. Anne's daughter is a very charming woman.", "correctness": false}, {"question_id": 91, "substitution": "Anne gave birth to a daughter last month. Anne is a very charming baby.", "correctness": false}, {"question_id": 91, "substitution": "Anne gave birth to a daughter last month. Anne's daughter is a very charming baby.", "correctness": true}, {"question_id": 92, "substitution": "Alice tried frantically to stop her daughter from chatting at the party, leaving us to wonder why Alice was behaving so strangely.", "correctness": true}, {"question_id": 92, "substitution": "Alice tried frantically to stop her daughter from chatting at the party, leaving us to wonder why Alice's daughter was behaving so strangely.", "correctness": false}, {"question_id": 93, "substitution": "Alice tried frantically to stop her daughter from barking at the party, leaving us to wonder why Alice was behaving so strangely.", "correctness": false}, {"question_id": 93, "substitution": "Alice tried frantically to stop her daughter from barking at the party, leaving us to wonder why Alice's daughter was behaving so strangely.", "correctness": true}, {"question_id": 94, "substitution": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know why Jim was, but he looked very unhappy.", "correctness": true}, {"question_id": 94, "substitution": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know why the guy in uniform was, but he looked very unhappy.", "correctness": false}, {"question_id": 95, "substitution": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know who Jim was, but he looked very unhappy.", "correctness": false}, {"question_id": 95, "substitution": "I saw Jim yelling at some guy in a military uniform with a huge red beard. I don't know who the guy in uniform was, but he looked very unhappy.", "correctness": true}, {"question_id": 96, "substitution": "The fish ate the worm. The fish was hungry.", "correctness": true}, {"question_id": 96, "substitution": "The fish ate the worm. The worm was hungry.", "correctness": false}, {"question_id": 97, "substitution": "The fish ate the worm. The fish was tasty.", "correctness": false}, {"question_id": 97, "substitution": "The fish ate the worm. The worm was tasty.", "correctness": true}, {"question_id": 98, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The key in.", "correctness": true}, {"question_id": 98, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The chewing gum in.", "correctness": false}, {"question_id": 99, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The key out.", "correctness": false}, {"question_id": 99, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The chewing gum out.", "correctness": true}, {"question_id": 100, "substitution": "The dog chased the cat, which ran up a tree. The dog waited at the bottom.", "correctness": true}, {"question_id": 100, "substitution": "The dog chased the cat, which ran up a tree. The cat waited at the bottom.", "correctness": false}, {"question_id": 101, "substitution": "The dog chased the cat, which ran up a tree. The dog waited at the top.", "correctness": false}, {"question_id": 101, "substitution": "The dog chased the cat, which ran up a tree. The cat waited at the top.", "correctness": true}, {"question_id": 102, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The tree removed.", "correctness": true}, {"question_id": 102, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The roof removed.", "correctness": false}, {"question_id": 103, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The tree repaired.", "correctness": false}, {"question_id": 103, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The roof repaired.", "correctness": true}, {"question_id": 104, "substitution": "The customer walked into the bank and stabbed one of the tellers. The customer was immediately taken to the police station.", "correctness": true}, {"question_id": 104, "substitution": "The customer walked into the bank and stabbed one of the tellers. The teller was immediately taken to the police station.", "correctness": false}, {"question_id": 105, "substitution": "The customer walked into the bank and stabbed one of the tellers. The customer was immediately taken to the hospital.", "correctness": false}, {"question_id": 105, "substitution": "The customer walked into the bank and stabbed one of the tellers. The teller was immediately taken to the hospital.", "correctness": true}, {"question_id": 106, "substitution": "John was doing research in the library when he heard a man humming and whistling. John was very annoyed.", "correctness": true}, {"question_id": 106, "substitution": "John was doing research in the library when he heard a man humming and whistling. The man was very annoyed.", "correctness": false}, {"question_id": 107, "substitution": "John was doing research in the library when he heard a man humming and whistling. John was very annoying.", "correctness": false}, {"question_id": 107, "substitution": "John was doing research in the library when he heard a man humming and whistling. The man was very annoying.", "correctness": true}, {"question_id": 108, "substitution": "John was jogging through the park when he saw a man juggling watermelons. John was very impressed.", "correctness": true}, {"question_id": 108, "substitution": "John was jogging through the park when he saw a man juggling watermelons. The juggler was very impressed.", "correctness": false}, {"question_id": 109, "substitution": "John was jogging through the park when he saw a man juggling watermelons. John was very impressive.", "correctness": false}, {"question_id": 109, "substitution": "John was jogging through the park when he saw a man juggling watermelons. The juggler was very impressive.", "correctness": true}, {"question_id": 110, "substitution": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. Bob was very ill.", "correctness": true}, {"question_id": 110, "substitution": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. Carl was very ill.", "correctness": false}, {"question_id": 111, "substitution": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. Bob was very concerned.", "correctness": false}, {"question_id": 111, "substitution": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. Carl was very concerned.", "correctness": true}, {"question_id": 112, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Sam and Amy are fifteen.", "correctness": true}, {"question_id": 112, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Amy's parents are fifteen.", "correctness": false}, {"question_id": 113, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Sam and Amy are snobs.", "correctness": false}, {"question_id": 113, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Amy's parents are snobs.", "correctness": true}, {"question_id": 114, "substitution": "Mark told Pete many lies about himself, which Pete included in his book. Mark should have been more truthful.", "correctness": true}, {"question_id": 114, "substitution": "Mark told Pete many lies about himself, which Pete included in his book. Pete should have been more truthful.", "correctness": false}, {"question_id": 115, "substitution": "Mark told Pete many lies about himself, which Pete included in his book. Mark should have been more skeptical.", "correctness": false}, {"question_id": 115, "substitution": "Mark told Pete many lies about himself, which Pete included in his book. Pete should have been more skeptical.", "correctness": true}, {"question_id": 116, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving out of The old house on Thursday.", "correctness": true}, {"question_id": 116, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving out of The new house on Thursday.", "correctness": false}, {"question_id": 117, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving into The old house on Thursday.", "correctness": false}, {"question_id": 117, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving into The new house on Thursday.", "correctness": true}, {"question_id": 118, "substitution": "Many people start to read Paul's books and can't put them down. People are gripped because Paul writes so well.", "correctness": true}, {"question_id": 118, "substitution": "Many people start to read Paul's books and can't put them down. Paul's books are gripped because Paul writes so well.", "correctness": false}, {"question_id": 119, "substitution": "Many people start to read Paul's books and can't put them down. People are popular because Paul writes so well.", "correctness": false}, {"question_id": 119, "substitution": "Many people start to read Paul's books and can't put them down. Paul's books are popular because Paul writes so well.", "correctness": true}, {"question_id": 120, "substitution": "Mary took out her flute and played one of her favorite pieces. She has had The flute since she was a child.", "correctness": true}, {"question_id": 120, "substitution": "Mary took out her flute and played one of her favorite pieces. She has had The piece since she was a child.", "correctness": false}, {"question_id": 121, "substitution": "Mary took out her flute and played one of her favorite pieces. She has loved The flute since she was a child.", "correctness": false}, {"question_id": 121, "substitution": "Mary took out her flute and played one of her favorite pieces. She has loved The piece since she was a child.", "correctness": true}, {"question_id": 122, "substitution": "Sam pulled up a chair to the piano, but The chair was broken, so he had to stand instead.", "correctness": true}, {"question_id": 122, "substitution": "Sam pulled up a chair to the piano, but The piano was broken, so he had to stand instead.", "correctness": false}, {"question_id": 123, "substitution": "Sam pulled up a chair to the piano, but The chair was broken, so he had to sing instead.", "correctness": false}, {"question_id": 123, "substitution": "Sam pulled up a chair to the piano, but The piano was broken, so he had to sing instead.", "correctness": true}, {"question_id": 124, "substitution": "Since it was raining, I carried the newspaper in my backpack to keep The newspaper dry.", "correctness": true}, {"question_id": 124, "substitution": "Since it was raining, I carried the newspaper in my backpack to keep The backpack dry.", "correctness": false}, {"question_id": 125, "substitution": "Since it was raining, I carried the newspaper over my backpack to keep The newspaper dry.", "correctness": false}, {"question_id": 125, "substitution": "Since it was raining, I carried the newspaper over my backpack to keep The backpack dry.", "correctness": true}, {"question_id": 126, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She reads The book when she gets home from work.", "correctness": true}, {"question_id": 126, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She reads The article when she gets home from work.", "correctness": false}, {"question_id": 127, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She writes The book when she gets home from work.", "correctness": false}, {"question_id": 127, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She writes The article when she gets home from work.", "correctness": true}, {"question_id": 128, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked The sand castle down.", "correctness": true}, {"question_id": 128, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked The flag down.", "correctness": false}, {"question_id": 129, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the wind knocked The sand castle down.", "correctness": false}, {"question_id": 129, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the wind knocked The flag down.", "correctness": true}, {"question_id": 130, "substitution": "Jane knocked on Susan's door, but there was no answer. Jane was disappointed.", "correctness": true}, {"question_id": 130, "substitution": "Jane knocked on Susan's door, but there was no answer. Susan was disappointed.", "correctness": false}, {"question_id": 131, "substitution": "Jane knocked on Susan's door, but there was no answer. Jane was out.", "correctness": false}, {"question_id": 131, "substitution": "Jane knocked on Susan's door, but there was no answer. Susan was out.", "correctness": true}, {"question_id": 132, "substitution": "Jane knocked on the door, and Susan answered it. Jane invited her to come out.", "correctness": true}, {"question_id": 132, "substitution": "Jane knocked on the door, and Susan answered it. Susan invited her to come out.", "correctness": false}, {"question_id": 133, "substitution": "Jane knocked on the door, and Susan answered it. Jane invited her to come in.", "correctness": false}, {"question_id": 133, "substitution": "Jane knocked on the door, and Susan answered it. Susan invited her to come in.", "correctness": true}, {"question_id": 134, "substitution": "Sam took French classes from Adam, because Sam was eager to speak it fluently.", "correctness": true}, {"question_id": 134, "substitution": "Sam took French classes from Adam, because Adam was eager to speak it fluently.", "correctness": false}, {"question_id": 135, "substitution": "Sam took French classes from Adam, because Sam was known to speak it fluently.", "correctness": false}, {"question_id": 135, "substitution": "Sam took French classes from Adam, because Adam was known to speak it fluently.", "correctness": true}, {"question_id": 136, "substitution": "The path to the lake was blocked, so we couldn't use The path .", "correctness": true}, {"question_id": 136, "substitution": "The path to the lake was blocked, so we couldn't use The lake .", "correctness": false}, {"question_id": 137, "substitution": "The path to the lake was blocked, so we couldn't reach The path .", "correctness": false}, {"question_id": 137, "substitution": "The path to the lake was blocked, so we couldn't reach The lake .", "correctness": true}, {"question_id": 138, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The sun was out.", "correctness": true}, {"question_id": 138, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The cloud was out.", "correctness": false}, {"question_id": 139, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The sun was gone.", "correctness": false}, {"question_id": 139, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The cloud was gone.", "correctness": true}, {"question_id": 140, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The lake was a safer place to swim.", "correctness": true}, {"question_id": 140, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The ocean beach was a safer place to swim.", "correctness": false}, {"question_id": 141, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The lake was a dangerous place to swim.", "correctness": false}, {"question_id": 141, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The ocean beach was a dangerous place to swim.", "correctness": true}, {"question_id": 142, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The shepherds ended up looking more like golfers.", "correctness": true}, {"question_id": 142, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The sheep ended up looking more like golfers.", "correctness": false}, {"question_id": 143, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The shepherds ended up looking more like dogs.", "correctness": false}, {"question_id": 143, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The sheep ended up looking more like dogs.", "correctness": true}, {"question_id": 144, "substitution": "Mary tucked her daughter Anne into bed, so that Mary could work.", "correctness": true}, {"question_id": 144, "substitution": "Mary tucked her daughter Anne into bed, so that Mary's daughter could work.", "correctness": false}, {"question_id": 145, "substitution": "Mary tucked her daughter Anne into bed, so that Mary could sleep.", "correctness": false}, {"question_id": 145, "substitution": "Mary tucked her daughter Anne into bed, so that Mary's daughter could sleep.", "correctness": true}, {"question_id": 146, "substitution": "Fred and Alice had very warm down coats, but Fred and Alice were not prepared for the cold in Alaska.", "correctness": true}, {"question_id": 146, "substitution": "Fred and Alice had very warm down coats, but coats were not prepared for the cold in Alaska.", "correctness": false}, {"question_id": 147, "substitution": "Fred and Alice had very warm down coats, but Fred and Alice were not enough for the cold in Alaska.", "correctness": false}, {"question_id": 147, "substitution": "Fred and Alice had very warm down coats, but coats were not enough for the cold in Alaska.", "correctness": true}, {"question_id": 148, "substitution": "Thomson visited Cooper's grave in 1765. At that date Thomson had been travelling for five years.", "correctness": true}, {"question_id": 148, "substitution": "Thomson visited Cooper's grave in 1765. At that date Cooper had been travelling for five years.", "correctness": false}, {"question_id": 149, "substitution": "Thomson visited Cooper's grave in 1765. At that date Thomson had been dead for five years.", "correctness": false}, {"question_id": 149, "substitution": "Thomson visited Cooper's grave in 1765. At that date Cooper had been dead for five years.", "correctness": true}, {"question_id": 150, "substitution": "Jackson was greatly influenced by Arnold, though Jackson lived two centuries later.", "correctness": true}, {"question_id": 150, "substitution": "Jackson was greatly influenced by Arnold, though Arnold lived two centuries later.", "correctness": false}, {"question_id": 151, "substitution": "Jackson was greatly influenced by Arnold, though Jackson lived two centuries earlier.", "correctness": false}, {"question_id": 151, "substitution": "Jackson was greatly influenced by Arnold, though Arnold lived two centuries earlier.", "correctness": true}, {"question_id": 152, "substitution": "I can't cut that tree down with that axe; The tree is too thick.", "correctness": true}, {"question_id": 152, "substitution": "I can't cut that tree down with that axe; The axe is too thick.", "correctness": false}, {"question_id": 153, "substitution": "I can't cut that tree down with that axe; The tree is too small.", "correctness": false}, {"question_id": 153, "substitution": "I can't cut that tree down with that axe; The axe is too small.", "correctness": true}, {"question_id": 154, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to kill The foxes .", "correctness": true}, {"question_id": 154, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to kill The chickens .", "correctness": false}, {"question_id": 155, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to guard The foxes .", "correctness": false}, {"question_id": 155, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to guard The chickens .", "correctness": true}, {"question_id": 156, "substitution": "The foxes are getting in at night and attacking the chickens. The foxes have gotten very bold.", "correctness": true}, {"question_id": 156, "substitution": "The foxes are getting in at night and attacking the chickens. The chickens have gotten very bold.", "correctness": false}, {"question_id": 157, "substitution": "The foxes are getting in at night and attacking the chickens. The foxes have gotten very nervous.", "correctness": false}, {"question_id": 157, "substitution": "The foxes are getting in at night and attacking the chickens. The chickens have gotten very nervous.", "correctness": true}, {"question_id": 158, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He opened His eyes when the wind stopped.", "correctness": true}, {"question_id": 158, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He opened His hands when the wind stopped.", "correctness": false}, {"question_id": 159, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He lowered His eyes when the wind stopped.", "correctness": false}, {"question_id": 159, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He lowered His hands when the wind stopped.", "correctness": true}, {"question_id": 160, "substitution": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured Terpsichore was too hard to pronounce.", "correctness": true}, {"question_id": 160, "substitution": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured Tina was too hard to pronounce.", "correctness": false}, {"question_id": 161, "substitution": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured Terpsichore was easier to pronounce.", "correctness": false}, {"question_id": 161, "substitution": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured Tina was easier to pronounce.", "correctness": true}, {"question_id": 162, "substitution": "Fred watched TV while George went out to buy groceries. After an hour Fred got up.", "correctness": true}, {"question_id": 162, "substitution": "Fred watched TV while George went out to buy groceries. After an hour George got up.", "correctness": false}, {"question_id": 163, "substitution": "Fred watched TV while George went out to buy groceries. After an hour Fred got back.", "correctness": false}, {"question_id": 163, "substitution": "Fred watched TV while George went out to buy groceries. After an hour George got back.", "correctness": true}, {"question_id": 164, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The dishwasher on.", "correctness": true}, {"question_id": 164, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The TV on.", "correctness": false}, {"question_id": 165, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The dishwasher off.", "correctness": false}, {"question_id": 165, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The TV off.", "correctness": true}, {"question_id": 166, "substitution": "Fred is the only man still alive who remembers my great-grandfather. Fred is a remarkable man.", "correctness": true}, {"question_id": 166, "substitution": "Fred is the only man still alive who remembers my great-grandfather. My great-grandfather is a remarkable man.", "correctness": false}, {"question_id": 167, "substitution": "Fred is the only man still alive who remembers my great-grandfather. Fred was a remarkable man.", "correctness": false}, {"question_id": 167, "substitution": "Fred is the only man still alive who remembers my great-grandfather. My great-grandfather was a remarkable man.", "correctness": true}, {"question_id": 168, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, Fred was twelve years old.", "correctness": true}, {"question_id": 168, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, My father was twelve years old.", "correctness": false}, {"question_id": 169, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, Fred was twelve months old.", "correctness": false}, {"question_id": 169, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, My father was twelve months old.", "correctness": true}, {"question_id": 170, "substitution": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, Kamchatka were defeated within weeks.", "correctness": true}, {"question_id": 170, "substitution": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, Yakutsk were defeated within weeks.", "correctness": false}, {"question_id": 171, "substitution": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, Kamchatka were victorious within weeks.", "correctness": false}, {"question_id": 171, "substitution": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, Yakutsk were victorious within weeks.", "correctness": true}, {"question_id": 172, "substitution": "Look! There is a minnow swimming right below that duck! The minnow had better get away to safety fast!", "correctness": true}, {"question_id": 172, "substitution": "Look! There is a minnow swimming right below that duck! The duck had better get away to safety fast!", "correctness": false}, {"question_id": 173, "substitution": "Look! There is a shark swimming right below that duck! The shark had better get away to safety fast!", "correctness": false}, {"question_id": 173, "substitution": "Look! There is a shark swimming right below that duck! The duck had better get away to safety fast!", "correctness": true}, {"question_id": 174, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Archaeologists hunted for evidence on the river banks.", "correctness": true}, {"question_id": 174, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Prehistoric humans hunted for evidence on the river banks.", "correctness": false}, {"question_id": 175, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Archaeologists hunted for deer on the river banks.", "correctness": false}, {"question_id": 175, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Prehistoric humans hunted for deer on the river banks.", "correctness": true}, {"question_id": 176, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The scientists began two years ago.", "correctness": true}, {"question_id": 176, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The fish began two years ago.", "correctness": false}, {"question_id": 177, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The scientists appeared two years ago.", "correctness": false}, {"question_id": 177, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The fish appeared two years ago.", "correctness": true}, {"question_id": 178, "substitution": "The journalists interviewed the stars of the new movie. The journalists were very persistent, so the interview lasted for a long time.", "correctness": true}, {"question_id": 178, "substitution": "The journalists interviewed the stars of the new movie. The stars were very persistent, so the interview lasted for a long time.", "correctness": false}, {"question_id": 179, "substitution": "The journalists interviewed the stars of the new movie. The journalists were very cooperative, so the interview lasted for a long time.", "correctness": false}, {"question_id": 179, "substitution": "The journalists interviewed the stars of the new movie. The stars were very cooperative, so the interview lasted for a long time.", "correctness": true}, {"question_id": 180, "substitution": "The police arrested all of the gang members. The police were trying to stop the drug trade in the neighborhood.", "correctness": true}, {"question_id": 180, "substitution": "The police arrested all of the gang members. The gang members were trying to stop the drug trade in the neighborhood.", "correctness": false}, {"question_id": 181, "substitution": "The police arrested all of the gang members. The police were trying to run the drug trade in the neighborhood.", "correctness": false}, {"question_id": 181, "substitution": "The police arrested all of the gang members. The gang members were trying to run the drug trade in the neighborhood.", "correctness": true}, {"question_id": 182, "substitution": "I put the cake away in the refrigerator. The cake has a lot of butter in it.", "correctness": true}, {"question_id": 182, "substitution": "I put the cake away in the refrigerator. The refrigerator has a lot of butter in it.", "correctness": false}, {"question_id": 183, "substitution": "I put the cake away in the refrigerator. The cake has a lot of leftovers in it.", "correctness": false}, {"question_id": 183, "substitution": "I put the cake away in the refrigerator. The refrigerator has a lot of leftovers in it.", "correctness": true}, {"question_id": 184, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The ankles should be better.", "correctness": true}, {"question_id": 184, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The crutches should be better.", "correctness": false}, {"question_id": 185, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The ankles should be unnecessary.", "correctness": false}, {"question_id": 185, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The crutches should be unnecessary.", "correctness": true}, {"question_id": 186, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The sponsors were very much in the minority.", "correctness": true}, {"question_id": 186, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The opponents were very much in the minority.", "correctness": false}, {"question_id": 187, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The sponsors were very much in the majority.", "correctness": false}, {"question_id": 187, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The opponents were very much in the majority.", "correctness": true}, {"question_id": 188, "substitution": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make more of The oatmeal cookies .", "correctness": true}, {"question_id": 188, "substitution": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make more of The chocolate chip cookies .", "correctness": false}, {"question_id": 189, "substitution": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make fewer of The oatmeal cookies .", "correctness": false}, {"question_id": 189, "substitution": "Everyone really loved the oatmeal cookies; only a few people liked the chocolate chip cookies. Next time, we should make fewer of The chocolate chip cookies .", "correctness": true}, {"question_id": 190, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply not enough of copies of the newsletter .", "correctness": true}, {"question_id": 190, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply not enough of chairs .", "correctness": false}, {"question_id": 191, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply too many of copies of the newsletter .", "correctness": false}, {"question_id": 191, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply too many of chairs .", "correctness": true}, {"question_id": 192, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The pin left a hole.", "correctness": true}, {"question_id": 192, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The carrot left a hole.", "correctness": false}, {"question_id": 193, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The pin had a hole.", "correctness": false}, {"question_id": 193, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The carrot had a hole.", "correctness": true}, {"question_id": 194, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The pen got full of coffee.", "correctness": true}, {"question_id": 194, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The coffee got full of coffee.", "correctness": false}, {"question_id": 195, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The pen got full of ink.", "correctness": false}, {"question_id": 195, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The coffee got full of ink.", "correctness": true}, {"question_id": 196, "substitution": "Steve follows Fred's example in everything. Steve admires him hugely.", "correctness": true}, {"question_id": 196, "substitution": "Steve follows Fred's example in everything. Fred admires him hugely.", "correctness": false}, {"question_id": 197, "substitution": "Steve follows Fred's example in everything. Steve influences him hugely.", "correctness": false}, {"question_id": 197, "substitution": "Steve follows Fred's example in everything. Fred influences him hugely.", "correctness": true}, {"question_id": 198, "substitution": "The table won't fit through the doorway because The table is too wide.", "correctness": true}, {"question_id": 198, "substitution": "The table won't fit through the doorway because The doorway is too wide.", "correctness": false}, {"question_id": 199, "substitution": "The table won't fit through the doorway because The table is too narrow.", "correctness": false}, {"question_id": 199, "substitution": "The table won't fit through the doorway because The doorway is too narrow.", "correctness": true}, {"question_id": 200, "substitution": "Grace was happy to trade me her sweater for my jacket. She thinks The sweater looks dowdy on her.", "correctness": true}, {"question_id": 200, "substitution": "Grace was happy to trade me her sweater for my jacket. She thinks The jacket looks dowdy on her.", "correctness": false}, {"question_id": 201, "substitution": "Grace was happy to trade me her sweater for my jacket. She thinks The sweater looks great on her.", "correctness": false}, {"question_id": 201, "substitution": "Grace was happy to trade me her sweater for my jacket. She thinks The jacket looks great on her.", "correctness": true}, {"question_id": 202, "substitution": "John hired Bill to take care of John .", "correctness": true}, {"question_id": 202, "substitution": "John hired Bill to take care of Bill .", "correctness": false}, {"question_id": 203, "substitution": "John hired himself out to Bill to take care of John .", "correctness": false}, {"question_id": 203, "substitution": "John hired himself out to Bill to take care of Bill .", "correctness": true}, {"question_id": 204, "substitution": "John promised Bill to leave, so an hour later John left.", "correctness": true}, {"question_id": 204, "substitution": "John promised Bill to leave, so an hour later Bill left.", "correctness": false}, {"question_id": 205, "substitution": "John ordered Bill to leave, so an hour later John left.", "correctness": false}, {"question_id": 205, "substitution": "John ordered Bill to leave, so an hour later Bill left.", "correctness": true}, {"question_id": 206, "substitution": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Goodman faced in his research.", "correctness": true}, {"question_id": 206, "substitution": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Xenophanes faced in his research.", "correctness": false}, {"question_id": 207, "substitution": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Goodman faced in his childhood.", "correctness": false}, {"question_id": 207, "substitution": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties Xenophanes faced in his childhood.", "correctness": true}, {"question_id": 208, "substitution": "Emma's mother had died long ago, and Emma education had been managed by an excellent woman as governess.", "correctness": true}, {"question_id": 208, "substitution": "Emma's mother had died long ago, and Emma's mother education had been managed by an excellent woman as governess.", "correctness": false}, {"question_id": 209, "substitution": "Emma's mother had died long ago, and Emma place had been taken by an excellent woman as governess.", "correctness": false}, {"question_id": 209, "substitution": "Emma's mother had died long ago, and Emma's mother place had been taken by an excellent woman as governess.", "correctness": true}, {"question_id": 210, "substitution": "Jane knocked on Susan's door but Jane did not get an answer.", "correctness": true}, {"question_id": 210, "substitution": "Jane knocked on Susan's door but Susan did not get an answer.", "correctness": false}, {"question_id": 211, "substitution": "Jane knocked on Susan's door but Jane did not answer.", "correctness": false}, {"question_id": 211, "substitution": "Jane knocked on Susan's door but Susan did not answer.", "correctness": true}, {"question_id": 212, "substitution": "Joe paid the detective after Joe received the final report on the case.", "correctness": true}, {"question_id": 212, "substitution": "Joe paid the detective after the detective received the final report on the case.", "correctness": false}, {"question_id": 213, "substitution": "Joe paid the detective after Joe delivered the final report on the case.", "correctness": false}, {"question_id": 213, "substitution": "Joe paid the detective after the detective delivered the final report on the case.", "correctness": true}, {"question_id": 214, "substitution": "Beth didn't get angry with Sally, who had cut her off, because Beth stopped and counted to ten.", "correctness": true}, {"question_id": 214, "substitution": "Beth didn't get angry with Sally, who had cut her off, because Sally stopped and counted to ten.", "correctness": false}, {"question_id": 215, "substitution": "Beth didn't get angry with Sally, who had cut her off, because Beth stopped and apologized.", "correctness": false}, {"question_id": 215, "substitution": "Beth didn't get angry with Sally, who had cut her off, because Sally stopped and apologized.", "correctness": true}, {"question_id": 216, "substitution": "Jim signaled the barman and gestured toward Jim empty glass", "correctness": true}, {"question_id": 216, "substitution": "Jim signaled the barman and gestured toward The barman empty glass", "correctness": false}, {"question_id": 217, "substitution": "Jim signaled the barman and gestured toward Jim bathroom key.", "correctness": false}, {"question_id": 217, "substitution": "Jim signaled the barman and gestured toward The barman bathroom key.", "correctness": true}, {"question_id": 218, "substitution": "Dan took the rear seat while Bill claimed the front because Dan \"Dibs!\" was slow.", "correctness": true}, {"question_id": 218, "substitution": "Dan took the rear seat while Bill claimed the front because Bill \"Dibs!\" was slow.", "correctness": false}, {"question_id": 219, "substitution": "Dan took the rear seat while Bill claimed the front because Dan \"Dibs!\" was quicker.", "correctness": false}, {"question_id": 219, "substitution": "Dan took the rear seat while Bill claimed the front because Bill \"Dibs!\" was quicker.", "correctness": true}, {"question_id": 220, "substitution": "Tom said \"Check\" to Ralph as he moved Tom bishop.", "correctness": true}, {"question_id": 220, "substitution": "Tom said \"Check\" to Ralph as he moved Ralph bishop.", "correctness": false}, {"question_id": 221, "substitution": "Tom said \"Check\" to Ralph as he took Tom bishop.", "correctness": false}, {"question_id": 221, "substitution": "Tom said \"Check\" to Ralph as he took Ralph bishop.", "correctness": true}, {"question_id": 222, "substitution": "As Andrea in the crop duster passed over Susan, Andrea could see the landing strip.", "correctness": true}, {"question_id": 222, "substitution": "As Andrea in the crop duster passed over Susan, Susan could see the landing strip.", "correctness": false}, {"question_id": 223, "substitution": "As Andrea in the crop duster passed over Susan, Andrea could see the landing gear.", "correctness": false}, {"question_id": 223, "substitution": "As Andrea in the crop duster passed over Susan, Susan could see the landing gear.", "correctness": true}, {"question_id": 224, "substitution": "Tom gave Ralph a lift to school so Tom wouldn't have to drive alone.", "correctness": true}, {"question_id": 224, "substitution": "Tom gave Ralph a lift to school so Ralph wouldn't have to drive alone.", "correctness": false}, {"question_id": 225, "substitution": "Tom gave Ralph a lift to school so Tom wouldn't have to walk.", "correctness": false}, {"question_id": 225, "substitution": "Tom gave Ralph a lift to school so Ralph wouldn't have to walk.", "correctness": true}, {"question_id": 226, "substitution": "Bill passed the half-empty plate to John because Bill was full.", "correctness": true}, {"question_id": 226, "substitution": "Bill passed the half-empty plate to John because John was full.", "correctness": false}, {"question_id": 227, "substitution": "Bill passed the half-empty plate to John because Bill was hungry.", "correctness": false}, {"question_id": 227, "substitution": "Bill passed the half-empty plate to John because John was hungry.", "correctness": true}, {"question_id": 228, "substitution": "Bill passed the gameboy to John because Bill turn was over.", "correctness": true}, {"question_id": 228, "substitution": "Bill passed the gameboy to John because John turn was over.", "correctness": false}, {"question_id": 229, "substitution": "Bill passed the gameboy to John because Bill turn was next.", "correctness": false}, {"question_id": 229, "substitution": "Bill passed the gameboy to John because John turn was next.", "correctness": true}, {"question_id": 230, "substitution": "The man lifted the boy onto The man shoulders.", "correctness": true}, {"question_id": 230, "substitution": "The man lifted the boy onto The boy shoulders.", "correctness": false}, {"question_id": 231, "substitution": "The man lifted the boy onto The man bunk bed.", "correctness": false}, {"question_id": 231, "substitution": "The man lifted the boy onto The boy bunk bed.", "correctness": true}, {"question_id": 232, "substitution": "Stretching The woman back, the woman smiled at the girl.", "correctness": true}, {"question_id": 232, "substitution": "Stretching The girl back, the woman smiled at the girl.", "correctness": false}, {"question_id": 233, "substitution": "Patting The woman back, the woman smiled at the girl.", "correctness": false}, {"question_id": 233, "substitution": "Patting The girl back, the woman smiled at the girl.", "correctness": true}, {"question_id": 234, "substitution": "Billy cried because Toby wouldn't accept Billy toy.", "correctness": true}, {"question_id": 234, "substitution": "Billy cried because Toby wouldn't accept Toby toy.", "correctness": false}, {"question_id": 235, "substitution": "Billy cried because Toby wouldn't share Billy toy.", "correctness": false}, {"question_id": 235, "substitution": "Billy cried because Toby wouldn't share Toby toy.", "correctness": true}, {"question_id": 236, "substitution": "Lily spoke to Donna, breaking Lily silence.", "correctness": true}, {"question_id": 236, "substitution": "Lily spoke to Donna, breaking Donna silence.", "correctness": false}, {"question_id": 237, "substitution": "Lily spoke to Donna, breaking Lily concentration.", "correctness": false}, {"question_id": 237, "substitution": "Lily spoke to Donna, breaking Donna concentration.", "correctness": true}, {"question_id": 238, "substitution": "When Tommy dropped his ice cream, Timmy giggled, so father gave Tommy a sympathetic look.", "correctness": true}, {"question_id": 238, "substitution": "When Tommy dropped his ice cream, Timmy giggled, so father gave Timmy a sympathetic look.", "correctness": false}, {"question_id": 239, "substitution": "When Tommy dropped his ice cream, Timmy giggled, so father gave Tommy a stern look.", "correctness": false}, {"question_id": 239, "substitution": "When Tommy dropped his ice cream, Timmy giggled, so father gave Timmy a stern look.", "correctness": true}, {"question_id": 240, "substitution": "As Ollie carried Tommy up the long winding steps, Ollie legs ached.", "correctness": true}, {"question_id": 240, "substitution": "As Ollie carried Tommy up the long winding steps, Tommy legs ached.", "correctness": false}, {"question_id": 241, "substitution": "As Ollie carried Tommy up the long winding steps, Ollie legs dangled.", "correctness": false}, {"question_id": 241, "substitution": "As Ollie carried Tommy up the long winding steps, Tommy legs dangled.", "correctness": true}, {"question_id": 242, "substitution": "The father carried the sleeping boy in The father arms", "correctness": true}, {"question_id": 242, "substitution": "The father carried the sleeping boy in The boy arms", "correctness": false}, {"question_id": 243, "substitution": "The father carried the sleeping boy in The father bassinet.", "correctness": false}, {"question_id": 243, "substitution": "The father carried the sleeping boy in The boy bassinet.", "correctness": true}, {"question_id": 244, "substitution": "The woman held the girl against The woman chest", "correctness": true}, {"question_id": 244, "substitution": "The woman held the girl against The girl chest", "correctness": false}, {"question_id": 245, "substitution": "The woman held the girl against The woman will.", "correctness": false}, {"question_id": 245, "substitution": "The woman held the girl against The girl will.", "correctness": true}, {"question_id": 246, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam's parents were furious about it.", "correctness": true}, {"question_id": 246, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam and Paul were furious about it.", "correctness": false}, {"question_id": 247, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam's parents were embarrassed about it.", "correctness": false}, {"question_id": 247, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam and Paul were embarrassed about it.", "correctness": true}, {"question_id": 248, "substitution": "Dr. Adams informed Kate that Dr. Adams had retired and presented several options for future treatment.", "correctness": true}, {"question_id": 248, "substitution": "Dr. Adams informed Kate that Kate had retired and presented several options for future treatment.", "correctness": false}, {"question_id": 249, "substitution": "Dr. Adams informed Kate that Dr. Adams had cancer and presented several options for future treatment.", "correctness": false}, {"question_id": 249, "substitution": "Dr. Adams informed Kate that Kate had cancer and presented several options for future treatment.", "correctness": true}, {"question_id": 250, "substitution": "Dan had to stop Bill from toying with the injured bird. Dan is very compassionate.", "correctness": true}, {"question_id": 250, "substitution": "Dan had to stop Bill from toying with the injured bird. Bill is very compassionate.", "correctness": false}, {"question_id": 251, "substitution": "Dan had to stop Bill from toying with the injured bird. Dan is very cruel.", "correctness": false}, {"question_id": 251, "substitution": "Dan had to stop Bill from toying with the injured bird. Bill is very cruel.", "correctness": true}, {"question_id": 252, "substitution": "George got free tickets to the play, but he gave them to Eric, even though George was particularly eager to see it.", "correctness": true}, {"question_id": 252, "substitution": "George got free tickets to the play, but he gave them to Eric, even though Eric was particularly eager to see it.", "correctness": false}, {"question_id": 253, "substitution": "George got free tickets to the play, but he gave them to Eric, because George was particularly eager to see it.", "correctness": false}, {"question_id": 253, "substitution": "George got free tickets to the play, but he gave them to Eric, because Eric was particularly eager to see it.", "correctness": true}, {"question_id": 254, "substitution": "George got free tickets to the play, but he gave them to Eric, because George was not particularly eager to see it.", "correctness": true}, {"question_id": 254, "substitution": "George got free tickets to the play, but he gave them to Eric, because Eric was not particularly eager to see it.", "correctness": false}, {"question_id": 255, "substitution": "Jane gave Joan candy because Jane wasn't hungry.", "correctness": true}, {"question_id": 255, "substitution": "Jane gave Joan candy because Joan wasn't hungry.", "correctness": false}, {"question_id": 256, "substitution": "Jane gave Joan candy because Jane was hungry.", "correctness": false}, {"question_id": 256, "substitution": "Jane gave Joan candy because Joan was hungry.", "correctness": true}, {"question_id": 257, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemons came out looking more like light bulbs.", "correctness": true}, {"question_id": 257, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemon trees came out looking more like light bulbs.", "correctness": false}, {"question_id": 258, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemons came out looking more like telephone poles.", "correctness": false}, {"question_id": 258, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemon trees came out looking more like telephone poles.", "correctness": true}, {"question_id": 259, "substitution": "James asked Robert for a favor but James was refused.", "correctness": true}, {"question_id": 259, "substitution": "James asked Robert for a favor but Robert was refused.", "correctness": false}, {"question_id": 260, "substitution": "James asked Robert for a favor but James refused.", "correctness": false}, {"question_id": 260, "substitution": "James asked Robert for a favor but Robert refused.", "correctness": true}, {"question_id": 261, "substitution": "Kirilov ceded the presidency to Shatov because Kirilov was less popular.", "correctness": true}, {"question_id": 261, "substitution": "Kirilov ceded the presidency to Shatov because Shatov was less popular.", "correctness": false}, {"question_id": 262, "substitution": "Kirilov ceded the presidency to Shatov because Kirilov was more popular.", "correctness": false}, {"question_id": 262, "substitution": "Kirilov ceded the presidency to Shatov because Shatov was more popular.", "correctness": true}, {"question_id": 263, "substitution": "Emma did not pass the ball to Janie although Emma saw that she was open.", "correctness": true}, {"question_id": 263, "substitution": "Emma did not pass the ball to Janie although Janie saw that she was open.", "correctness": false}, {"question_id": 264, "substitution": "Emma did not pass the ball to Janie although Emma was open.", "correctness": false}, {"question_id": 264, "substitution": "Emma did not pass the ball to Janie although Janie was open.", "correctness": true}, {"question_id": 265, "substitution": "I put the butterfly wing on the table and The butterfly wing broke.", "correctness": true}, {"question_id": 265, "substitution": "I put the butterfly wing on the table and The table broke.", "correctness": false}, {"question_id": 266, "substitution": "I put the heavy book on the table and The heavy book broke.", "correctness": false}, {"question_id": 266, "substitution": "I put the heavy book on the table and The table broke.", "correctness": true}, {"question_id": 267, "substitution": "Madonna fired her trainer because Madonna couldn't stand her boyfriend.", "correctness": true}, {"question_id": 267, "substitution": "Madonna fired her trainer because The trainer couldn't stand her boyfriend.", "correctness": false}, {"question_id": 268, "substitution": "Madonna fired her trainer because Madonna slept with her boyfriend.", "correctness": false}, {"question_id": 268, "substitution": "Madonna fired her trainer because The trainer slept with her boyfriend.", "correctness": true}, {"question_id": 269, "substitution": "Madonna fired her trainer because she slept with Madonna boyfriend.", "correctness": true}, {"question_id": 269, "substitution": "Madonna fired her trainer because she slept with The trainer boyfriend.", "correctness": false}, {"question_id": 270, "substitution": "Madonna fired her trainer because she couldn't stand Madonna boyfriend.", "correctness": false}, {"question_id": 270, "substitution": "Madonna fired her trainer because she couldn't stand The trainer boyfriend.", "correctness": true}, {"question_id": 271, "substitution": "Carol believed that Rebecca suspected that Carol had stolen the watch.", "correctness": true}, {"question_id": 271, "substitution": "Carol believed that Rebecca suspected that Rebecca had stolen the watch.", "correctness": false}, {"question_id": 272, "substitution": "Carol believed that Rebecca regretted that Carol had stolen the watch.", "correctness": false}, {"question_id": 272, "substitution": "Carol believed that Rebecca regretted that Rebecca had stolen the watch.", "correctness": true}]